{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.7.0",
  "convertedBy": "TensorFlow.js Converter v3.7.0",
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "batch_input_shape": [
                null,
                400
              ],
              "dtype": "float32",
              "units": 400,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "categorical_crossentropy",
      "metrics": [
        "accuracy"
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "SGD",
        "config": {
          "learning_rate": 0.01,
          "momentum": 0.0,
          "decay": 0.0,
          "nesterov": false
        }
      }
    },
    "backend": "tensorflow"
  }
}
